/*****************************************************************//**
* File     : x3dlib.h
* Brief    : Xử lý các thao tác vector 3d cơ bản
* Update   :
*           [Create] : 19/05/2020 - DesertFox
*           [Update] : 09/11/2020 - DesertFox
* TODO     :
*********************************************************************/\


#ifndef X3DLIB_H
#define X3DLIB_H

#include "xbase.h"


namespace fox
{
    /***********************************************************************
    * Trừ hai vector                [3D]
    * [Author]: DesertFox         - [Date] : 09/11/2020
    **********************************************************************/
    Vec3D DllExport V3sub(const Vec3D& a, const Vec3D& b);

    /***********************************************************************
    * Cộng hai vector               [3D]
    * [Author]: DesertFox         - [Date] : 09/11/2020
    **********************************************************************/
    Vec3D DllExport V3add(const Vec3D& a, const Vec3D& b);

    /***********************************************************************
    * Tính trung điểm của hai điểm    [3D]
    * [Author]: DesertFox           - [Date] : 09/11/2020
    **********************************************************************/
    Vec3D DllExport V3mid(const Vec3D& a, const Vec3D& b) ;

    /***********************************************************************
    * Nhân vector với một số      [3D]
    * [Author]: DesertFox       - [Date] : 12/11/2020
    **********************************************************************/
    Vec3D DllExport V3mul(const Vec3D& v, const FLT& factor);

    /***********************************************************************
    * Lấy tỉ lệ của vector         [3D]
    * [Author]: DesertFox       - [Date] : 09/11/2020
    **********************************************************************/
    Vec3D DllExport V3div(const Vec3D& a, FLT factor) ;

    /***********************************************************************
    * Độ lớn của vector           [3D]
    * [Author]: DesertFox       - [Date] : 09/11/2020
    **********************************************************************/
    FLT DllExport V3mag(const Vec3D& a);

    /***********************************************************************
    * Tính vector đơn vị           [3D]
    * [Author]: DesertFox        - [Date] : 09/11/2020
    **********************************************************************/
    Vec3D DllExport V3uint(const Vec3D& a);
}



#endif // !X3DLIB_H
